[
	{
		"title": "Are you a true frontend ninja?",
		"date": "2014-08-03",
		"author": "Alber Pedraza",
		"description": "Many of you will ask yourselves, what is this 'Ninja' thing? Well, for those of you who don't know yet, it's a professional who masters a specialty at levels much higher than the average, above the rest of professional mortals, so you can understand me, the top in professionals of his category.",
		"text": "<p>Many of you may wonder, what is that about 'Ninja' well, for those who do not know yet, he is a professional who dominates a specialty at levels much higher than the average, over the rest of professional mortals, so that you understand me, the top in professionals in its category.</p><h4>Hard work, passion and dedication</h4><p>Be careful, it is important to point out , this can only be achieved with a lot of effort, passion for the work we do and filming in it. As we all know, it is not easy to achieve even more a title as important as being considered a ninja of some subject, but do not be scared if you decide to move towards this goal dear friends, acquaintances and not so well known frontend development readers, with hard work, passion and dedication are all achieved.</p><h4>Accumulate new knowledge</h4><p>Other issues to take into account is perseverance, perseverance ... they are not only the values ​​that we have been counting before, which are not easy to have or achieve, I would say that it is more vocational than anything else.</p><p>We talk about always being there at the top, rubbing shoulders with the best professionals who develop our same work and that has a very expensive cost, it means always studying. Make no mistake, do not think that a professional who is always studying about his profession, is a novice in the field because he does not master the knowledge, on the contrary, if a record is maintained and new knowledge accumulates daily, there will come a time when you are You are the one who contributes all the knowledge that you already have in mind to the other colleagues of the union in the form of notes, books, examples etc ... everything to facilitate the work and believe me that this is appreciated in the end.</p><h4>Are you determined?</h4><p>So if you are one of those who work and apart from absorbing all the knowledge you can constantly, you are closer to reaching that long-awaited goal that many professionals dream of ... being a true ninja of their work.</p><p>Here in frontend development, we absorb knowledge on a daily basis, always driven by passion and dedication for this work that makes many of us lose sleep.</p><p>And you? are you already a frontend ninja? or do you plan to work hard to become one?</p>",
		"image": "post-1.jpg",
		"url": "https://desarrollofrontend.com/eres-un-verdadero-ninja-frontend/"
	},
	{
		"title": "Digital Services Law (DSA): the great European regulation that can change the internet as we know it",
		"date": "2020-10-30",
		"author": "Enrrique Perez",
		"description": "'The Digital Services Act (DSA) has the potential to be one of the most relevant technology regulations of our generation,' states the GSMA.",
		"text": "<p>'The <strong>Digital Services Act (DSA)</strong> has the potential to be one of the most relevant technology regulations of our generation,' states the GSMA. Europe is preparing its great project to regulate the digital world and establish the lines that large technology companies must comply with. An ambitious plan that will cover everything from advertising and the management of our data to the responsibility of the platforms for the content published on them.</p><p>To date, the European Union has tried to stop the abusive practices of companies like Google or Facebook through millions of dollars fines, but as Margrethe Vestager , European Commissioner for Competition explained: 'In this digital age, we need <strong>the power to do more than investigate individual cases</strong>'.</p><p>Two decades have passed since the Directive on electronic commerce, which is still in force, and touches <strong>new European regulations, adapted to the times</strong>. This is what we know about the future Digital Services Law, what is the position of the European Commission on the issues to be regulated, what companies defend, what is the calendar and what impact it may have on our use of the internet.</p><h4>What is the DSA and what will it cover</h4><p>The Digital Services Law aims to renew the directive on electronic commerce, but it will take advantage of the occasion to add <strong>new regulations for digital platforms</strong>. In February 2020, the Commission published the document 'Shaping Europe's digital future' where it was established that by the end of this year \"new and revised rules would be created to deepen the internal market for digital services, increasing and harmonizing the <strong>responsibilities of the platforms online</strong> and strengthening the supervision of content policies in the EU\".</p><p>According to one of the proposals for the month of October , the scope of the ' Digital Services Act' will cover 'from social networks, to the services of the collaborative economy, through search engines, online advertising, services in the cloud, Wi-Fi access points, web page hosting, messaging services, app stores, comparison tools, artificial intelligence-based services, content delivery networks, and naming services domain'.</p><p>Future regulations will seek to <strong>\"clarify the content of the concept of 'illegal content'\"</strong> and will attempt to clearly establish between what is a non-economic content activity and <strong>what advertising comprises</strong>. That is, differentiate the rules that should apply to normal content and what are the rules for sponsored content and other advertising publications.</p><p>Another <strong>concept that the DSA will try to define is that of 'systemic operator'</strong>, in reference to those companies that can hold an important position in the market and act as 'gatekeepers'. It is not clear at the moment what impact these operators would have and if being considered as such could have legal effects, but large technology companies such as Google, Facebook or Amazon are expected to be included in this category. <strong>How this category will be defined has not been specified and will be something to analyze</strong>, but it is expected to be through a combination of quantitative and qualitative criteria.</p>",
		"image": "post-2.jpg",
		"url": "https://www.xataka.com/legislacion-y-derechos/ley-servicios-digitales-dsa-que-sabemos-gran-proyecto-europeo-que-puede-cambiar-internet-tal-como-conocemos"
	},
	{
		"title": "Nikola, who was running as the most promising electric vehicle maker since Tesla, cancels his Badger pickup",
		"date": "2020-12-01",
		"author": "Cristian Rus",
		"description": "For a few moments this year Nikola aimed to be 'the next Tesla' in the world of electric vehicles. With his bet on hydrogen and the promises of his electric truck, his new Nikola Badger truck shot the company in valuation. A few months later things have changed, a lot. Nikola just announced that they have canceled the development of Nikola Badger, his hydrogen pickup.",
		"text": "<p>For a few moments this year <strong>Nikola aimed to be 'the next Tesla' in the world of electric vehicles</strong>. With his bet on hydrogen and the promises of his electric truck, his new Nikola Badger truck shot the company in valuation. A few months later things have changed, a lot. Nikola just announced that they have canceled the development of Nikola Badger, his hydrogen pickup.</p><p>The Nikola Badger was a truck that <strong>aimed for almost 1,000 kilometers of autonomy</strong>, from 0 to 100 km / h in 2.9 seconds and 900 horses among other things. All this in large part thanks to its hydrogen fuel cell.</p><h4>Accusations, resignations, cancellations</h4><p>Things have not happened overnight. A series of events <strong>in recent weeks have caused Nikola to abandon the project</strong>. First came the allegations of fraud in September and then the allegations of sexual misconduct by its CEO, prompting him to resign.</p><p>Now and perhaps more importantly, General Motors has canceled its agreement with Nikola. The agreement included among other things the <strong>manufacture of the Nikola Badger by General Motors</strong> in exchange for part of its technology and exclusive rights of sale. After different accusations of fraud in the startups, General Motors has decided to exit the agreement.</p><p>This has triggered Nikola to have no choice but to cancel the development of what seemed to be his flagship product. With the cancellation of the van, Nikola has indicated that he will <strong>return the money for the reservations to the users.</strong></p><p>The company is now expected to <strong>focus on the development of electric trucks</strong>, something with which it took the first steps years ago and before introducing the Nikola Badger. Its maximum exponent in this aspect right now is the Nikola TRE.</p>",
		"image": "post-3.jpg",
		"url": "https://www.xataka.com/vehiculos/nikola-que-se-postulaba-como-fabricante-vehiculos-electricos-prometedor-tesla-cancela-su-pickup-badger"
	},
	{
		"title": "What is cybersecurity and what is it for?",
		"date": "2020-05-09",
		"author": "Francisco Rubio",
		"description": "We can say that cybersecurity encompasses a large number of techniques and methods to protect our system, as well as other devices or networks.",
		"text": "<h4>WHAT IS CYBER SECURITY?</h4><p>ISACA (Information Systems Audit and Control Association) professionals define <strong>cybersecurity</strong> as 'a layer of protection for information files, which, based on it, works to avoid all kinds of threats, which put information at risk. which is processed, transported and stored on any device'.</p><p>Thanks to the different tools available in this area, your system can be protected from attacks, hackers or any type of computer crime. To do this, it is necessary to update and equip the systems with the best measures.</p><p>In short, <strong>what does cybersecurity consist of</strong> ? We can say that it is the practice of defending electronic devices and systems, servers, networks and data from malicious attacks. It is applied to many elements and in different phases. It is also called, <strong>information security, computer security or digital security</strong>.</p><h4>PHASES OF CYBER SECURITY</h4><p>If you are looking to protect yourself from the threats of the current era, you must carry out a series of computer security measures.</p><p>According to specialized studies and manuals on cybersecurity , we can divide this process into different phases: prevention, location and reaction.</p><ul><li><h5>PREVENTION</h5><p>The first step that we must always take, even in everyday life, is prevention , since in this way we greatly reduce the risk margin.</p><p>What do we advise you? Act early and find out. It is very important to determine the threats, set prevention and reaction measures, and in the event of an attack, you will be prepared.</p><p>You cannot forget cybersecurity training, in the case of a company, for all workers. Tools, action protocols, preventive measures, etc., to guarantee the maximum level of security for you and the company.</p><p>Let's make it difficult for <strong>hackers</strong>!</p></li><li><h5>LOCATION</h5><p>If prevention has not been enough to prevent an attack, the second step would be to <strong>locate the problem</strong>. The most normal and fast? Use a powerful <strong>antivirus</strong> that communicates in real time that you are suffering a threat, although as you know, some <strong>hackers</strong> disguise themselves and it is more difficult to locate the infection or attack.</p><p>As a general rule, it can take up to 100 days to realize that your system or device has been hacked, which is something that should be reduced as much as possible. It can be achieved by forcefully managing the vulnerabilities of the system, as well as, jointly carrying out continuous monitoring.</p></li><li><h5>REACTION</h5><p>When the threat is already localized, it is time to react , giving a technical answer about it. You can follow these 4 steps:</p><ul><li>Disconnect the computers from the network and then install an antivirus that meets current needs, or upgrade the existing one to the latest version.</li><li>It then performs a system scan and changes all passwords.</li><li>An important step is to carry out a comprehensive cleaning of the system, so that in this way, you can be sure that there is no danger.</li><li>If you have suffered a theft of data and / or confidential information, communicate it to the affected users and, of course, report it as a computer crime.</li></ul></li></ul>",
		"image": "post-4.jpg",
		"url": "https://www.expacioweb.com/que-es-y-para-que-sirve-la-ciberseguridad/"
	},
	{
		"title": "After the arrival of 5G, do fiber networks and WiFi make sense?",
		"date": "2019-06-25",
		"author": "Ramon Peco",
		"description": "These days there is a lot of talk about the irruption of 5G in several cities in Spain. The speeds that the new communications protocol is reaching, despite still being in its infancy, are much higher than those of 4G networks. If we add to this that with the arrival of 5G so are flat data rates, it is common sense to wonder if fiber optics and WiFi networks will continue to make sense in homes and companies.",
		"text": "<p>These days there is a lot of talk about the irruption of 5G in several cities in Spain. The speeds that the new communications protocol is reaching, despite still being in its infancy, are much higher than those of <strong>4G networks</strong>. If we add to this that with <strong>the arrival of 5G</strong> so are flat data rates, it is common sense to wonder if fiber optics and WiFi networks will continue to make sense in homes and companies.</p><p>Before going into more details, it is convenient to differentiate what are called <strong>5G WiFi</strong> networks, which already incorporate many routers and devices. These have nothing to do with 5G networks. This type of WiFi connection is so called because it operates in a <strong>5 Ghz</strong> frequency band, different from old WiFi connections. The distinction is important as it can lead to errors when choosing certain devices and services.</p><p>Focusing on 5G networks, the speed of data transfer and response, its latency, improves what some WiFi networks offer. That in theory would allow in the medium term that these networks can be even more interesting to transfer data than <strong>fiber optics and WiFi</strong>. But for that, a much greater deployment of 5G networks is needed.</p><p>On the other hand, WiFi technology is also evolving. The WiFi 6 networks , which are still a rarity but already equipped devices like Galaxy S10 , allow download speeds of up to 1 giga using 2.4 GHz frequency, but this speed is increased to 4.8 theoretical gigas the 5Ghz band. The interesting thing about these networks is that several devices can be connected at the same time. 5G networks however allow the connection of a single device.</p><p>Although that device can be a router. In fact, products of this type already exist. As is the case with the 5G D-Link DWR-2010 router . This device allows to receive a 5G signal and distribute it like a router connected to a fiber optic network. The funny thing is that to use a wireless network that replaces the cable is not as necessary as it seems a 5G connection.<p><p>In many countries 4G networks are as fast or faster than the standard cable-based Internet connections that can be contracted with the operators. This is revealed by a 2018 study by Open Signal (PDF). Although, we already warn that Spain is not on the list of countries that have been the object of the study.</p><p>In fact, some users, due to the rise in the amounts of data that can be transferred monthly, have begun to do without fiber networks. This trend may increase when flat data rates begin to become popular, such as the one Vodafone already offers for 4G and 5G networks.</p><p>But the truth is that the future improvement of WiFi connections means that this technology continues to be almost essential. Even if at a certain moment telecommunications operators consider it more interesting for data to reach our homes and work spaces through 5G networks.</p><p>This scenario has certain disadvantages for those who continue to bet on using the cable, either for security reasons or because of the stability it provides when supplying data. Let's not forget that the most stable and secure connections are achieved by directly connecting an Ethernet cable from a router to the computer.</p><p>Especially considering the saturation suffered by some homes due to the large number of nearby WiFi connections. Even some professional devices still use the old Ethernet cables. As is the case with some professional cameras, which have this kind of connection due to the high data transfer speed it allows.</p>",
		"image": "post-5.jpg",
		"url": "https://www.lavanguardia.com/tecnologia/20190625/463060610394/redes-5g-4g-fibra-cable-router-velocidad-cambio-tarifa-plana.html"
	},
	{
		"title": "What does a social media do and how to become one?",
		"date": "2019-25-07",
		"author": "Hotmart",
		"description": "Social networks have transformed communication, brought companies and consumers closer together, strengthening interaction and having an important impact on building and maintaining the brand.",
		"text": "<p>Social networks have transformed communication, brought companies and consumers closer together, strengthening interaction and having an important impact on building and maintaining the brand.</p><p>In this scenario, a professional dedicated to understanding and following this relationship is necessary, and this is one of the main functions of social media.</p><p>Today, it is almost impossible to think of an organization that does not have communication channels on social media.</p><p>Be it a profile on Facebook, Instagram, Twitter or LinkedIn, brands are present in these environments to follow what is being said about them and influence consumer decision-making.</p><p>Social media is a strategic professional in the development of mechanisms and tools that can bring the business closer to followers, consumers and potential clients.</p><p>In this post, we will talk about the outstanding characteristics of the social media professional, showing how this role has become increasingly essential for the strengthening and growth of organizations. Let's go!</p><h4>What is a social media?</h4><p>Social networks have become a true showcase for brands. Many people even joke that if a business is not on any of these channels, it is because it does not exist.</p><p>This thinking follows the logic of the growth of users on social networks in recent years.</p><p>Therefore, it is essential that organizations are present in these environments to establish a closer conversation with their consumers and potential customers, as well as to deliver relevant content.</p><p>It is in this context that social media fits in, because it is responsible for the development of social media strategies, content creation, interaction with the public and monitoring of metrics.</p><p>Take a look at the main tasks that social media performs on a daily basis:</p><p>What is a social media?</p><p><strong>Social media is the professional responsible for the social networks of a company and takes care of the following points:</strong></p><ol><li>Development of strategies for the different buyer personas of the business.</li><li>Creation of relevant content for followers.</li><li>Monitoring of mentions to the company and care with the brand's health.</li><li>Interaction with the public in comments and messages.</li><li>Definition and monitoring of metrics in various social networks.</li><li>Manage ads and sponsored posts to attract more traffic.</li></ol><p>To understand the reason for the current importance of social media for the digital marketing strategies of organizations, we must delve into what are the works developed by this type of professional.</p><p>Producing <strong>content for social networks</strong> is just one of the functions of social media. In fact, a lot of knowledge of the different <strong>types of buyer persona in</strong> the business is necessary to develop a specific strategy directed at each one.</p><p>The approach must be personalized and close to establish an effective dialogue.</p><p>Social media allows unique benefits, such as strengthening empathy.</p><p>It is through one of these channels that the brand can interact with a dissatisfied user, for example, understanding the point that caused the bad feeling and turning that experience into something positive and satisfying.</p><p>It is worth remembering that a dissatisfied customer on social channels can cause a cascading effect for brands.</p><p>In social profiles, publications gain breadth, manage to echo in the heads of several people and modify the impression that some have about a certain brand.</p><p>Social media, therefore, is the professional that strategically helps the brand to maintain its image, by creating content that brings together and transforms the consumer experience before and after the purchase.</p><p>With a well-designed strategic plan, social media can positively impact the life of the consumer, making the person who has purchased a product or service from the company become a promoter of the brand, encouraging others to buy it.</p><p>To be efficient, the professional must be integrated with the networks, know the resources of each one of them, the possibilities they offer for interaction and monitoring, in order to extract relevant data for a closer and more welcoming approach with the person.</p><p>For example, social media needs to know the difference between creating an individual page or profile on Facebook.</p><p>In the end, analyzing the metrics becomes easier when creating a business profile. The same goes for other social networks, such as Instagram and LinkedIn.</p>To understand a little more about the profile of this professional, we will address the applications of social media jobs. Keep reading it!</p>",
		"image": "post-6.jpg",
		"url": "https://blog.hotmart.com/es/social-media/"
	},
	{
		"title": "Robotics in the classroom: Spanish schools set out to train the «engineers of the future»",
		"date": "2017-12-18",
		"author": "Patricia García",
		"description": "In 20 years, around 700 professions will be replaced by machines, according to a study carried out by the University of Oxford in 2016. In return, new jobs closely related to the digital world and robotics will emerge that will require professionals prepared to program and operate these machines. The problem is that, despite the accelerated pace with which the world is digitizing, the educational system in Spain is not yet ready to train students in these subjects.",
		"text": "<p>In 20 years, around 700 professions will be replaced by machines, according to a study carried out by the University of Oxford in 2016. In return, new jobs closely related to the digital world and robotics will emerge that will require professionals prepared to program and operate these machines. The problem is that, despite the accelerated pace with which the world is digitizing, the educational system in Spain is not yet ready to train students in these subjects.</p><p>“The European Community has warned on occasion that in 2020 there will be a shortage of professionals in this sector . There is an urgent demand and there is a rush to introduce it into the classrooms. Richard Huget is the general director of LEGO's 'Education Robotix' and spoke with this alert yesterday at the presentation of the company's alliance with the Edelvives publishing group to promote the use of robotics in Spanish schools.</p><p><strong>77.8% of companies reward the ability for teamwork over other qualities</strong></p><p>The intent of the agreement is to bring together technological knowledge and educational agents to, as Huget explained, prepare children in STEM - the acronym in English for science, technology, engineering and mathematics. From the editorial they believe that this didactic direction is 'fundamental because in the society in which they will live they will be integrated with robots.' All the speakers agreed that the objective goes beyond instructing small programmers : 'the approach is to put robotics to use, not only for programming, but also in the development of curricular content.'</p><p>'It is not a question of discarding the above and betting only on this,' explain sources from the publisher involved in the project, but it must be understood as 'a process of integration'. It will take a physical investment in the acquisition of materials, but also in the teachers, who will also have to learn to live with the machines in the classrooms and, in addition, teach the students. 'You have to keep in mind that it involves a conceptual change in classes and teaching and that you have to cover many types of teachers, not just technology.'</p>",
		"image": "post-7.jpg",
		"url": "https://www.abc.es/familia/educacion/abci-robotica-aulas-colegios-espanoles-lanzan-formar-ingenieros-futuro-201712150205_noticia.html?ref=https:%2F%2Fwww.google.com%2F"
	},
	{
		"title": "Do androids dream of silicon poetry? The great challenge of teaching machines human language",
		"date": "2020-10-21",
		"author": "Santiago Sánchez-Migallón",
		"description": "One of the most notable peculiarities of the human being is, without a doubt, the use of language. We use an intricate and vast network of symbols that, for millennia, far exceeded the biological function with which it was born. The richness of our language is much greater than what is necessary for our survival in the African savannah. Why this surplus of words, of grammatical and syntactic structures? Why this plurality of meanings, this semantic variety that enriches as well as confuses?",
		"text": "<p>One of the most notable peculiarities of the human being is, without a doubt, <strong>the use of language</strong>. We use an intricate and vast network of symbols that, for millennia, far exceeded the biological function with which it was born. The richness of our language is much greater than what is necessary for our survival in the African savannah. Why this surplus of words, of grammatical and syntactic structures? Why this plurality of meanings, this semantic variety that enriches as well as confuses?</p><p>But what's more, if the spoken language wasn't complex in itself, <strong>writing arrived</strong>. Ideograms, syllabaries and alphabets arrived. The monotonous cuneiform, the Phoenician, the most beautiful Greek and our sober Latin arrived. A pity not to write from right to left using aliphate, considered an art in its own right.</p><p>Machines, when they got serious, were not understood essentially as calculators, but as symbolic manipulators . Inspired by the famous Turing machines , artificial intelligence pioneers such as Allen Newell and Herbert Simon understood that a computer receives as inputs a series of symbols (letters or numbers) on which it performs operations: it deletes, stores, classifies or does mathematical or logical operations on them. In this way, new symbol structures are created that evolve as they are manipulated.</p><p>From the complicated <strong>machine language</strong> to the relatively simple Python, <strong>programming languages</strong> have represented an interface between the vast tangle of hardware microcircuits and the instructions of the programmer. The first languages, the lowest level, such as assembly language , were fundamentally based on being as friendly as possible for the programmer. As it is impossible to keep track of the millions of operations carried out by the processor, the instructions of the languages ​​are a kind of 'desktop icons', something simple that starts a multitude of complicated processes.</p><p>And so it went up to the <strong>high-level languages</strong>, which try to be the closest thing to pseudocode , that is, they try to resemble a natural language, to speak to the machine in English or Spanish. High-level languages ​​would be icons of icon icons ... language levels that communicate with other language levels, and with others and with others, creating semantic networks. And those networks are also alive.</p>",
		"image": "post-8.jpg",
		"url": "https://www.xataka.com/robotica-e-ia/suenan-androides-poesias-silicio-gran-reto-ensenar-a-maquinas-lenguaje-humano"
	},
	{
		"title": "Big data: what is it and what is it for?",
		"date": "2019-06-03",
		"author": "Drafting APD",
		"description": "Its origin is purely technological: to provide a solution to the large volume of data available to be able to save, analyze, process and create value and knowledge. Until recently, structured databases have responded to this situation. The big question remains:  Big Data, what is Big Data and  what is it for?",
		"text": "<p>Its origin is purely technological: to provide a solution to the large volume of data available to be able to save, analyze, process and create value and knowledge. Until recently, structured databases have responded to this situation. The big question remains: <strong>Big Data, what is Big Data and  what is it for?</strong></p><p>The current and future challenge is to combine them with other types of so-called unstructured data, which are data generated in different devices, applications or formats. Undoubtedly, a <strong>complex world of data</strong> that one by one has an important value, but that combined multiplies that value.</p><h4>Big data what it is and what it is for</h4><p>It is a term that describes the large amount of data (structured and unstructured) that abounds in a company on a daily basis. But not only the volume of data is important. What is really valuable is <strong>how to manage that information</strong> to achieve guidelines that lead to better decision making and strategic business actions.</p><h5>The seven Vs of big data</h5><p>Big data is based on the measurement of the following magnitudes:</p><ol><li><strong>Volume.</strong> Amount of data that is originated and stored in order to process and transform them into actions.<li><strong>Speed.</strong> The speed in which data is created, stored and processed in real time.</li><li><strong>Variety.</strong> Forms, types and sources in which the data is recorded: text documents, emails, audios, videos or images that reside on a mobile device, social media profiles, etc.</li><li><strong>Veracity.</strong> It is the quality of the data, that is, the degree of reliability of the information received.</li><li><strong>Viability.</strong> The ability of companies to make efficient use of the large volume of data they handle.</li><li><strong>Display.</strong> Mode in which data is displayed to find hidden clues and patterns in the topic to be investigated.</li><li><strong>Value.</strong> Data that is transformed into information, which in turn becomes knowledge and in turn an action or decision.</li></ol>",
		"image": "post-9.jpg",
		"url": "https://www.apd.es/big-data-que-es-y-para-que-sirve/"
	},
	{
		"title": "What is a database?",
		"date": "2020-09-30",
		"author": "Edgar F. Codd",
		"description": "Sitting at the core of an enterprise, a database is a collection of information that is organised so that a business can access, manage, and update it.",
		"text": "<p>Sitting at the core of an enterprise, a database is a collection of information that is organised so that a business can access, manage, and update it.</p><p>The most common type of database is a relational one; this is a database that is structured to recognise relations among data items as a set of formally-described tables.</p><p>There are also non-relational databases, often called a NoSQL database. The relational database is a tabular model, while a NoSQL database is not.</p><p>Database tables consist of columns and rows, much like an Excel spreadsheet. Each column contains a different type of attribute and each row corresponds to a single record, this model is particularly well suited to structured data while a NoSQL database is well suited to dealing with unstructured data.</p><p>There are four general types of NoSQL databases, a graph database, key value store, column store, and document database.</p>",
		"image": "post-10.jpg",
		"url": "https://www.cbronline.com/what-is/what-is-a-database-4917209/"
	}
]
